In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("Teams.csv")

In [3]:
data.shape

(12, 4)

In [4]:
#1. Select the first value from the Points column of dataset, assigning it to variable first_point.
first_point = data["Points"][0]
first_point

876

In [5]:
#2. Select the first row of data (the first record)
data[0:1]

   Points  Rank    Team  Year
0     876     1  Riders  2014

In [6]:
#3. Select the first 10 values from the Year column in dataset
data["Year"][0:9]

0    2014
1    2015
2    2014
3    2015
4    2014
5    2015
6    2016
7    2017
8    2016
Name: Year, dtype: int64

In [7]:
#4. Select the records with index labels 1, 2, 3, 5, and 8, assigning the result to the variable sample_records
a = data[1:6:2]

In [8]:
b = data[2:9:6]

In [9]:
sample_records = a.append(b)

In [10]:
sample_records

   Points  Rank    Team  Year
1     789     2  Riders  2015
3     673     3  Devils  2015
5     812     4   Kings  2015
2     863     2  Devils  2014
8     694     2  Riders  2016

In [11]:
#. Create a variable df containing the Rank, Points, Team columns of the records with the index labels 0, 5, 10
data1 = data

In [12]:
data1.drop(columns = ["Year"],inplace = True)

In [13]:
data1.head()

   Points  Rank    Team
0     876     1  Riders
1     789     2  Riders
2     863     2  Devils
3     673     3  Devils
4     741     3   Kings

In [14]:
sample_df = data1[0:11:5]
sample_df

    Points  Rank    Team
0      876     1  Riders
5      812     4   Kings
10     804     1  Royals

In [15]:
#6. Create a variable df containing the Team and Rank columns of the last 5 records.
data1.drop(columns = ["Points"],inplace = True)

In [16]:
data1[-5:]

    Rank    Team
7      1   Kings
8      2  Riders
9      4  Royals
10     1  Royals
11     2  Riders

In [17]:
#7. Create a variable df containing all even index labels
data = pd.read_csv("Teams.csv")

In [18]:
even_df = data[0:11:2]
even_df

    Points  Rank    Team  Year
0      876     1  Riders  2014
2      863     2  Devils  2014
4      741     3   Kings  2014
6      756     1   Kings  2016
8      694     2  Riders  2016
10     804     1  Royals  2015

In [19]:
#8. Create a variable df containing all odd index labels
odd_df = data[1:11:2]
odd_df

   Points  Rank    Team  Year
1     789     2  Riders  2015
3     673     3  Devils  2015
5     812     4   Kings  2015
7     788     1   Kings  2017
9     701     4  Royals  2014